def month_n(n):
    try:
        month = {1: 'Січень', 2: 'Лютий', 3: 'Березень', 4: 'Квітень', 5: 'Травень',
                 6: 'Червень', 7: 'Липень', 8: 'Серпень', 9: 'Вересень', 10: 'Жовтень',
                 11: 'Листопад', 12: 'Грудень'}
        return month[int(n)]
    except KeyError as ex:
        return 'Такого місяця не існує, введіть число в діапазоні від 1 до 12'
    except ValueError as ex:
        return 'Введене значення має бути цілим числом, яке знаходиться в діапазоні від 1 до 12'
    except Exception as ex:
        return 'Введіть число згідно до умови'


n = input('Введіть число, яке відповідає номеру, загадонного вами місяця:')
print(month_n(n))